---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData
source: html/10d3a290-e5ee-c989-d1c7-8349f1abc2c7.htm
---
# StructuralElementDefinitionData Members

Creates empty StructuralElementDefinitionData object.